src/bsl/DataProcessors/гкс_АРМКПП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>гкс_АРМКПП</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/bsl/Documents/гкс_ВъездНаКПП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>гкс_ВъездНаКПП</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФиоВодителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловиеПроезда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_УсловияПроезда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТранспортногоСредства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.гкс_ЗаписьВОчередьПриемкиПЛК</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/bsl/DataProcessors/гкс_АРМКПП/Forms/ФормаПодбораОчереди/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТаблицаДокументовОчереди.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДатаСеанса());
	ВременнойРазброс = Константы.гкс_ВременнойРазбросДляКПП.Получить();
	ТаблицаДокументовОчереди.Параметры.УстановитьЗначениеПараметра("ВременнойРазбросДляКПП", ВременнойРазброс * -1);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьДокумент(Команда)

	Оповещение = Новый ОписаниеОповещения("СоздатьДокументЗавершение", ЭтотОбъект);
	ТекстВопроса = НСтр("ru = 'Будет создан документ Въезд на КПП-1. Продолжить?'");
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);

КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	
	Закрыть();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыиФункции

&НаКлиенте
Процедура ВыполнитьПослеЗаписиДокумента(РезультатЗакрытия, ДопПараметры) Экспорт
	
	Элементы.ТаблицаДокументовОчереди.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументЗавершение(Результат, ДопПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		ТекущиеДанные = Элементы.ТаблицаДокументовОчереди.ТекущиеДанные;
	
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Контрагент", 					ТекущиеДанные.Контрагент);
		ПараметрыФормы.Вставить("Номенклатура", 				ТекущиеДанные.Номенклатура);
		ПараметрыФормы.Вставить("УсловиеПроезда", 				ТекущиеДанные.УсловиеПроезда);
		ПараметрыФормы.Вставить("НомерТранспортногоСредства", 	ТекущиеДанные.НомерТранспортногоСредства);
		ПараметрыФормы.Вставить("ДокументОснование", 			ТекущиеДанные.Ссылка);
	
		ОповещениеОЗакрытии = Новый ОписаниеОповещения("ВыполнитьПослеЗаписиДокумента", ЭтотОбъект);
		ОткрытьФорму("Документ.гкс_ВъездНаКПП.Форма.ФормаДокумента", 
						ПараметрыФормы, 
						ЭтотОбъект,,,, 
						ОповещениеОЗакрытии);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
